{
  "title": "О профессии",
  "text": "Программист – это специалист, занимающийся созданием компьютерных программ, приложений для телефонов и планшетов, различных интернет сервисов и сайтов.  Программист очень широкое понятие, у них много дополнительных специализаций, обобщенно все направления работы можно подразделить на три:\n\nПрикладное направление. Это специалисты, занимающиеся разработкой и внедрением программного обеспечения, необходимого для нормального функционирования организаций. Обычно они узкопрофильные, к примеру, специалисты по 1С. В спектр их обязанностей входит обновление, настройка и доработка программ под индивидуальные потребности сотрудников, специфику компании.\n\nСистемное направление. Это специалисты, разрабатывающие операционные системы, интерфейсы, распределяющие базы данных, управляющие работой сетей. \n\nWeb. Это специалисты, работающие с глобальными сетями, к примеру, интернетом. Разработка интерфейсов, динамических сайтов и т.п. \nВостребованность профессии\nПрофессия программиста широко востребована, многим требуются сайты и программы для работы с Сетью, уникальное программное обеспечение для производств и т.п. \n\nДля кого подходит профессия\nЭта профессия подойдет людям со следующими качествами: \n\nСистемное мышление. \nАналитический склад ума.\nХорошая память. \nУмение излагать информацию на понятном языке. \nУсловия труда\nПрограммисты проводят рабочий день в помещении. Работа происходит преимущественно сидя.Во время работы программист часто находится перед монитором компьютера, поэтому высока нагрузка на глаза.\n\nКарьера\nКарьера программиста напрямую зависит от его навыков и способности получать новые. Языки программирования -  основной инструмент его работы, бытро устаревают, создаются новые и специалист должен постоянно совершенствоваться в своей области, а также изучать новые направления. Карьерный рост,зачастую, выражается не в смене должности, а в росте заработной платы.  Хороший программист может со временем стать лидером своей команды, начальником IT-отдела и т.п. Многие программисты работают сами на себя: предлагают услуги своего интернет-сервиса для обслуживания других компаний или пишут сайты и сервисы на заказ. \n\nОбязанности\nДолжностные обязанности могут отличаться в зависимости от направления работы компании и задач конкретной программы, но чаще всего программист:\n\nРазрабатывает программы, проводит их тестирование и отладку.\nОсуществляет запуск отлаженных программ и ввод ее в эксплуатацию.\nПроводит корректировку разработанной программы на основе тестового периода использования.\nРазрабатывает инструкции по работе с программами, оформляет необходимую техническую документацию.\nОпределяет возможность использования готовых программных продуктов и т.п.",
  "test": {
    "head": "Тест для закрепления материала",
    "body": [
      {
        "title": "Кто такие программисты",
        "content": [
          {
            "title": "Люди ремонтрующие технику",
            "result": false
          },
          {
            "title": "Консультанты в магазинах техники",
            "result": false
          },
          {
            "title": "Учителя информатики",
            "result": false
          },
          {
            "title": "Специально обученные люди которые пишут программный код",
            "result": true
          }
        ]
      },
      {
        "title": "Кто такие программисты",
        "content": [
          {
            "title": "Люди ремонтрующие технику",
            "result": false
          },
          {
            "title": "Консультанты в магазинах техники",
            "result": false
          },
          {
            "title": "Учителя информатики",
            "result": false
          },
          {
            "title": "Люди которые пишут программный код",
            "result": true
          }
        ]
      },
      {
        "title": "Кто такие программисты",
        "content": [
          {
            "title": "Люди ремонтрующие технику",
            "result": false
          },
          {
            "title": "Консультанты в магазинах техники",
            "result": false
          },
          {
            "title": "Учителя информатики",
            "result": false
          },
          {
            "title": "Люди которые пишут программный код",
            "result": true
          }
        ]
      },
      {
        "title": "Кто такие программисты",
        "content": [
          {
            "title": "Люди ремонтрующие технику",
            "result": false
          },
          {
            "title": "Консультанты в магазинах техники",
            "result": false
          },
          {
            "title": "Учителя информатики",
            "result": false
          },
          {
            "title": "Люди которые пишут программный код",
            "result": true
          }
        ]
      },
      {
        "title": "Кто такие программисты",
        "content": [
          {
            "title": "Люди ремонтрующие технику",
            "result": false
          },
          {
            "title": "Консультанты в магазинах техники",
            "result": false
          },
          {
            "title": "Учителя информатики",
            "result": false
          },
          {
            "title": "Люди которые пишут программный код",
            "result": true
          }
        ]
      }
    ]
  }
}