{
  "title": "Как новичку выдержать растущую конкуренцию на IT-рынке",
  "text": "На прошедшем на днях Петербургском международном экономическом форуме заместитель председателя правительства РФ Дмитрий Чернышенко спрогнозировал привлечение иностранных айти-специалистов в российские компании.\n\nПохоже, конкуренция на IT-рынке в ближайшем будущем заметно вырастет. Начинающим специалистам в таких условия будет очень непросто найти хорошую работу. Но при правильном подходе вполне возможно. Давайте разбираться вместе, как занять свое место под солнцем.\n\nСформируйте портфолио\nЛучше один раз увидеть, чем сто раз услышать. Кандидат, которому есть что показать, всегда получает преимущество в сравнении с соискателями без портфолио. Проблема в том, что у новичков не так много реализованных проектов, которыми можно похвастаться.\n\nПоэтому начинающие айтишники часто попадают в замкнутый круг. Не могут найти работу, так как нет кейсов. Не могут собрать портфолио, потому что нет работы.\n\nЕсли вы оказались в подобной ситуации, не отчаивайтесь. Наверняка вы проходили практику или стажировку во время обучения. Даже для получения сертификата об окончании онлайн-курсов айти-специалистам нужно сдать итоговый проект. Все работы, выполненные в процессе учёбы, вполне сгодятся для портфолио.\n\nПусть в нём будет всего 1-2 кейса, но это всё же лучше, чем ничего. Кроме того, для количества можно выполнить парочку придуманных заданий.\n\nНапример, если вы начинающий PHP-разработчик, попробуйте создать простенький блог или форум. А претендентам на позицию веб-дизайнера можно сделать хотя бы пару интересных лендингов.\n\nСоставьте качественное резюме\nСегодня большинство компаний содержат целые отделы по управлению персоналом. Или как минимум имеют в штате HR-специалиста. Отделаться простеньким резюме, составленным «на коленке», точно не получится. Вашу анкету будут внимательно изучать. Поэтому потребуется позаботиться о её информативности и дизайне.\n\nПризнаки качественного резюме:\n\n· Занимает не более 1 страницы формата А4.\n\n· Содержит количественные показатели.\n\n· Наглядное, имеет четкую структуру.\n\n· Написано грамотным и понятным языком.\n\n· Содержит ключевые слова из вакансии.\n\n· Имеет интересное оформление.\n\nСоставить качественное резюме с чистого листа достаточно сложно. Поэтому лучше используйте готовые шаблоны.Откликайтесь на вакансии\nКогда у вас на руках будет портфолио и качественное резюме, приступайте к мониторингу вакансий. Ищите подходящие предложения как на популярных job-ресурсах, так и в специализированных группах в мессенджерах.\n\nПлощадки, где публикуются вакансии для айти-специалистов:\n\n· HeadHunter;\n\n· Superjob;\n\n· DTF;\n\n· Телеграм-канал MyResume;\n\n· Хабр. Карьера.\n\nТакже можете поискать объявления и на других ресурсах, например, в социальных сетях или на тематических форумах.\n\nИмейте в виду, что к кандидатурам начинающих IT-специалистов относятся настороженно и ждать обратной связи придется, возможно, несколько недель. Поэтому откликайтесь на все подходящие вакансии. Так вы устроитесь на работу гораздо быстрее.\n\nПодготовьтесь к собеседованию\nКогда получите приглашение на собеседование, не паникуйте. По главным критериям вы уже прошли. Теперь нужно подготовиться к личной встрече с HR-менеджером. Если будет возможность, заранее уточните у специалиста, сколько ещё испытаний у вас впереди.\n\nНекоторые организации ограничиваются одним интервью, где преимущественно задают стандартные вопросы. Такие, как:\n\n· Почему вы хотите работать у нас?\n\n· Какие задачи вам интересны?\n\n· Хотите ли продолжить обучение по специальности?\n\n· Когда вы сможете приступить к работе?\n\nОднако в большинстве IT-компаний предусмотрены дополнительные проверки. Например:\n\n· Техническое собеседование. Здесь вопросы будут зависеть от желаемой позиции и её функционала. Поэтому обязательно пройдитесь по теории и закрепите практику.\n\n· Интервью по ценностям. На этом этапе HR пройдется по вашим «мягким» навыкам. Возможно, спросит, как вы относитесь к командной работе, насколько уверенно чувствуете себя в коллективе, что может вызвать дискомфорт на рабочем месте.\n\n· Встреча с проектным менеджером или непосредственным руководителем. Немного напоминает техническое собеседование. Но здесь будут проверять только конкретные скилы, которые потребуются вам в работе.\n\nСовет! Если не знаете ответа на вопрос, не молчите. Попробуйте порассуждать вслух. Так вы хотя бы дадите понять, что разбираетесь в теме. Тем более, если интервьюер увидит логику в ваших рассуждениях, он сам сориентирует вас в нужном направлении.\n\nПодведем итоги\nПробиться на IT-рынке в условиях растущей конкуренции будет непросто. Особенно начинающим специалистам. Но опередить других претендентов и устроиться на хорошую позицию вполне реально. Главное, основательно подготовиться и верить в собственные силы.\n\n\n",
  "test": {
    "head": "Тест для закрепления материала",
    "body": [
      {
        "title": "Где не стоит искать работу программисту?",
        "content": [
          {
            "title": "HH.ru",
            "result": false
          },
          {
            "title": "Хабр",
            "result": false
          },
          {
            "title": "В газете",
            "result": true
          }
        ]
      },
      {
        "title": "Сколько зарабатывает Junior программист?",
        "content": [
          {
            "title": "20.000 - 40.000",
            "result": true
          },
          {
            "title": "50.000 - 70.000",
            "result": false
          },
          {
            "title": "80.000 - 110.000",
            "result": false
          }
        ]
      },
      {
        "title": "Сколько зарабатывает Middle программист?",
        "content": [
          {
            "title": "90.000 - 120.000",
            "result": true
          },
          {
            "title": "300.000 - 400.000",
            "result": false
          },
          {
            "title": "150.000 - 200.000",
            "result": true
          }
        ]
      },
      {
        "title": "Сколько зарабатывает Senior программист?",
        "content": [
          {
            "title": "20.000 - 50.000",
            "result": false
          },
          {
            "title": "90.000 - 120.000",
            "result": false
          },
          {
            "title": "150.000 - 500.000",
            "result": true
          }
        ]
      }
    ]
  }
}