{
  "title": "Будущее российского IT: что ждет отрасль в 2023 году\n\n",
  "text": "Технологии и инвестиции в их разработку — важнейшая часть экономического развития бизнеса и государства. Сегодня это не менее значимый элемент экономики, чем доступ к дешевым энергетическим ресурсам и компетентным кадрам на рынке. При этом IT-отрасль — одна из самых мобильных и демократичных. Ее участники всегда старались мыслить глобально.\n\nВо многом поэтому сейчас эта сфера переживает сложные времена, но продолжает развиваться в заданных условиях. Как именно — рассказываем в совместном материале Inc. и «Технологий Доверия» (экс-PwC).\n\nТехнологический суверенитет\nЭкономическая сфера жизни обычно следует за политической, поэтому возникшая за последние пару лет турбулентность в геополитике оказала влияние и на IT.\n\nМногие IT-тренды, которые раньше казались незыблемыми столпами (IoT, blockchain, автоматизация), начинают уходить на второй план, уступая место для более актуальной технологической повестке. Прежде всего, речь о повышении суверенитета и локализации ключевых технологий, которые нужны для исправной работы критической инфраструктуры бизнеса и государства. Безусловно, это не означает, что развитие IoT и blockchain сходит на нет. Речь о приоритезации потребностей бизнеса и общества: в фокус попадают более тактические цели.\n\nДо недавнего времени практически любая технологическая идея, если она не нацелена на завоевание глобального рынка, была заранее обречена на провал. Такого рода идеям было сложно привлечь инвестиции, жизнеспособность их бизнес-модели вызывала вопросы. Сейчас же мы находимся в той точке, когда жизнеспособность экономики в текущих условиях становятся важнее, чем глобальные конкурентные преимущества проекта.\n\nСегодняшний тренд на технологический суверенитет состоит как из позитивных, так и из негативных факторов для IT-отрасли — все они взаимосвязаны. С одной стороны, мы наблюдаем, как рынок покидают зарубежные вендоры ПО, при этом спрос сохраняется на том же уровне.\n\nТакая ситуация дает уникальную возможность условно бесплатно занять ниши, которые в обычном режиме пришлось бы завоевывать годами, если не десятилетиями.\n\nНовые государственные программы поддержки отрасли позволяют производителям получить дополнительный толчок в развитии, выпуская свои продукты или обновляя существующие в ускоренном режиме.\n\nНегативное влияние испытывают на себе, в первую очередь, потребители IT-продуктов и услуг. Что происходит? Сокращается предложение, повышается средняя стоимость. Внедрение новых систем предполагает дополнительные инвестиции в переобучение персонала и переквалификации части сотрудников под новый UX и функционал. Всё это в конечном итоге повышает розничную стоимость товаров и услуг и бьет по потребителю.\n\nСанкции и импортозамещение\nЗа последние десятилетия IT-инфраструктура стала критическим фактором не только цифровой трансформации, но и просто успешной работы любой компании — вне зависимости от того, чем она занимается. Тем сильнее бизнес ощущает на себе влияние санкций: такие необходимые операции, как замена серверов, сетевого и каналообразующего оборудования, систем хранения данных (СХД) и системного ПО превратились в довольно сложную задачу. Возросли риски перебоя не только развития, но и функционирования компаний как такового.\n\nНесмотря на все предыдущие усилия по импортозамещению так называемого программно-аппаратного комплекса (ПАК), основные российские игроки в этом сегменте — это всё еще компании, которые занимаются сборкой оборудования на западных компонентах. Если внимательно посмотреть на текущую ситуацию на российском рынке, которая с точки зрения цифр не сильно изменилась с 2021 года, то можно заметить, что доля западного оборудования в ней доходит до 90%. Что это значит для российского IT-бизнеса?\n\n\nХорошая новость заключается в том, что санкции уже сейчас поспособствовали не просто импортозамещению в сегменте ПАК, а движению к полной технологической независимости в сегменте. Плохая — в том, что существуют серьезные факторы, которые это развитие сдерживают. Основные — нехватка электронных компонентов, производственных мощностей и технологий для производства оборудования, которые раньше приходили из-за рубежа, недостаточное количество квалифицированных кадров на рынке и как следствие всего этого рост стоимости конечных продуктов.\n\nТакая ситуация сложилась во многом из-за отсутствия реальных возможностей и до недавнего времени насущной необходимости развивать локальное производство полного цикла. Всё, от микроэлектронных чипов до конечных продуктов (сервера, СХД, сетевое оборудование), исторически было сильно завязано на импорт. Свободный доступ к международному рынку оборудования и очень высокое качество компонентов западного производства демотивировали развивать испортозамещение в этой сфере.\n\nСегодня этот сегмент освободился для российских производителей и имеет высокий потенциал. Но чтобы реально создавать конкурентоспособные и востребованные продукты, нам нужно совершить технологический скачок.\n\nСделать это возможно, если использовать накопленный опыт и компетенции по работе с западным оборудованием, но в применении к нашим локальным технологиям. Самой проблемной областью остается производство продуктов для решения критичных задач: большие СХД уровня предприятий, высокопроизводительные вычислительные системы, оборудование уровня ядра сети и т.п.\n\nВсё это — задачи на годы вперед. В краткосрочной перспективе на первый план выходит параллельный импорт, а также поиск и вывод на рынок альтернативных поставщиков из стран, свободных от санкций. В среднесрочной перспективе также можно перейти на комплектующие и оборудование, близкие к потребительскому классу или масс-маркету: например, сервера стандартной архитектуры x86 и построенных на них вычислительных системах, использование открытых стандартов и протоколов, для которых пока еще доступны альтернативные логистические каналы, а сама экосреда не является закрытой. Доступ к ней не сможет быть ограничен одним из производителей (Microsoft, Apple, Cisco, IBM).\n\nОтдельный вопрос — каким образом теперь будет развиваться сегмент системного ПО. В него входят операционные системы, виртуализация, резервное копирование — то есть то, от чего напрямую зависит создание полноценной отечественной экосистемы в сегменте IT-инфраструктуры.\n\nСейчас более 90% ПО для системного программного слоя представлено западными разработчиками, а продукты немногих российских компаний либо построены на западных технологических платформах, либо ориентированы на них.\n\nПроблему усугубляет эффект «курицы и яйца»: развитие этого класса ПО сильно зависит от аппаратных компонентов и продуктов для IT-инфраструктуры, которые сначала должны получить широкое распространение в России, а распространение отечественных аппаратных платформ (сервера, СХД), в свою очередь, зависит от набора системного ПО, которое может полноценно на них работать.\n\n\nЧитать также\n\n2023 год: выберите свой сценарий работы и жизни\n\nВ локализации и импортозамещении IT-инфраструктуры как ни крути огромна роль государства— только оно, например, может эффективно стимулировать дополнительные закупки оборудования российских производителей. Какими возможностями и госпрограммами могут воспользоваться российские IT-компании?\n\n— Еще в 2015 году создан и функционирует Единый реестр российских программ для вычислительных машин и баз данных.\n\n— При Минпромторге появился и Реестр радиоэлектронной продукции, независимой частью которого стал Реестр телекоммуникационного оборудования российского происхождения. В 2021 году госкомпании должны были закупать 50% российских ноутбуков и ПК, в 2022-м — 60%, а в 2023-м — уже 70%.\n\n— Меняются критерии для признания оборудования российским и попадания его в реестр. Вводятся дополнительные льготы и субсидии со стороны государства:\n\nсубсидии на производство планшетов, смартфонов и ноутбуков в России;\nсубсидии за рекламу российских производителей электроники, включая ноутбуки, системные блоки и планшеты;\nстимулирование дополнительных закупок отечественного оборудования крупными российскими компаниями и компаниями с госучастием со стороны Минцифры, — это тоже по сути является дополнительным субсидированием производителей.\n— В качестве отдельного драйвера нужно отметить Указ № 166, который усиливает требования к инфраструктуре и информационной безопасности. В нем с 1 января 2025 г. органам государственной власти как заказчикам запрещается использовать иностранное ПО на принадлежащих им значимых объектах критической информационной инфраструктуры. Это открывает большие перспективы участия российских компаний в госзаказах.\n\n\nЧитать также\n\nЗамещай и властвуй: как новые льготы от Минцифры повлияют на IT-рынок\n\nКибербезопасность\nОтечественный рынок кибербезопасности, в отличие от других сфер отрасли, находится в довольно выгодном положении. Российские производители уже давно предлагают компаниям локальные решения практически в любом технологическом классе. Такая ситуация именно в сегменте кибербезопасности сложилась из-за политики государства в этой области и разработки довольно строгих стандартов, в результате чего на мировом рынке уже давно работают конкурентоспособные российские производители.\n\nСуществуют два основных фактора, которые трансформируют сферу кибербезопасности прямо сейчас:\n\nУход западных производителей и прекращение ими поддержки своих клиентов в России. Фактически оборудование и программное обеспечение, которое покупали отечественные компании, превратилось в тыкву, а в сегменте кибербезопаности это гораздо более чувствительно, чем в IT-инфраструктуре или бизнес-приложениях.\nОдновременное увеличение атак и инцидентов, связанных с кибербезопасностью. За последний год по нашим данным количество кибератак на инфраструктуру российских компаний увеличилось до 80 раз в пиковый период весной 2022 года по сравнению с тем же периодом в 2021 году.\n\nОдна из известных в публичном поле кибератак — это атака на станции зарядки электроавтомобилей на трассе М11. Также известно об атаках на компании пищевой промышленности, на финансовый сектор и отечественные промышленные компании.\n\nОтдельно стоит выделить новые типы угроз, а именно угрозы, связанные с повсеместным использованием продуктов с открытым исходным кодом. Увеличилось число атак, связанных с встраиванием вредоносного кода в веб и обновления ПО. DDOS-атаки тоже участились — 2022 год стал рекордсменом по их количеству.\n\nСместился и фокус атак: если раньше мишенью становились крупные компании, а главной целью было получить материальную выгоду, то сейчас атакам подвергается вся российская IT-инфраструктура. Выбираются компании и сегменты, в которых кибератака могла бы принести значительный, и, главное, видимый ущерб: прежде всего, речь о промышленных и государственных информационных системах, СМИ, ретейле и т.д.\n\nЧтобы эффективно, быстро и надежно разработать необходимый объем отечественного ПО и вывести его на рынок, необходимо тесное взаимодействие разных команд, — включая специалистов по кибербезопасности, которые отследят уязвимости и потенциальные угрозы в ПО, проверят надежность кода. Как следствие, мы наблюдаем тренд на построение и внедрение в культуру процессов DevSecOps — когда тестирование безопасности происходит на каждом этапе разработки программного обеспечения.\n\nКонкуренция и монополия\nЕсли посмотреть на отечественный рынок программного обеспечения, может создаться впечатление, что заместить российскими аналогами можно порядка 80% западного ПО. На самом деле в большинстве случаев локальные решения не смогут стать полноценной функциональной заменой глобальным аналогам и имеют свои ограничения.\n\nНапример, на российском рынке существует порядка 4-5 офисных пакетов, но пока что ни одно из них не является полноценной заменой MS Office. Доступны около десяти решений по виртуализации, но сегодня они тоже в полной мере не могут полноценно заменить решения от VMware или Microsoft. Учитывая уход западных разработчиков и реальный объем российского рынка ПО (по данным предыдущих годов он составляет 1-2% от мирового), для разработки сопоставимого по уровню с западными продукта потребуются колоссальные суммы, которые могут превосходить весь объем внутреннего рынка. Таких денег у коммерческих разработчиков, конечно, нет, и здесь нужна помощь государства и крупных компаний.\n\nВ ближайшем будущем потенциально возникнут фавориты в каждом классе ПО и оборудования, и на эти продукты и решения будет сделана государственная ставка. При таком подходе большая часть финансовых средств заказчиков (и субсидий) пойдет на развитие ПО одного производителя — возможно, это будет единственным шансом получить законченный продукт, который окажется конкурентоспособным на отечественном рынке. Весь вопрос в том, как выстроить требования к этому продукту со стороны бизнеса и государства.\n\nПотенциальные фавориты уже видны в сегменте ERP-систем, офисного программного обеспечения, частично операционных систем.\n\nНужно отметить, что за рубежом эта практика не нова, и условный монополизм крупных ИТ-компаний никого не смущает. Microsoft, например, — фактический монополист в сегменте клиентских операционных систем и офисного ПО, а SAP — в области ERP-систем.\n\nВ текущих условиях потенциальная монополизация IT-рынка может принести больше положительных результатов в среднесрочной перспективе, чем отрицательных. Конечно, не стоит забывать про влияние такой схемы на стоимость программных продуктов: уже сейчас мы видим, что в условиях ограниченной конкуренции и безальтернативности выбора отечественные решения дорожают, в некоторых случаях до 5 раз.\n\nНайм\nНехватка квалифицированных кадров в IT и раньше была проблемой, но переход на отечественные продукты и одновременный отток большого количества специалистов за рубеж сделали ее крайне серьезной. Если в 2021 году нехватка инженеров разработки ПО оценивалась в районе 1 млн. специалистов, то теперь разрыв между потребностью рынка труда и предложением увеличился в разы.\n\nТакой контекст повлияет на обучение IT-специалистов. Если раньше оно предполагало классическую модель подготовки (инженерный вуз или математический факультет, стажировка, получение опыта), то сейчас всё больше айтишников мы получаем путем переквалификации. В этом случае в подготовку вовлекаются уже опытные сотрудники, которые получают дополнительные знания не столько из университетских программ или центров повышения квалификации, сколько из онлайн-платформ и краткосрочных курсов. Пожалуй, самый яркий пример, который прямо сейчас реализовывается на рынке труда, — переквалификация специалистов SAP в специалистов 1С.\n\nМы ожидаем, что ускоренную переквалификацию кадров ожидают инвестиции.\n\nИ речь не только об инвестициях в рамках государственных программ: бизнес практически всех отраслей будет вкладываться в кадры и их развитие.\n\nНаблюдая за событиями, которые происходили в крупных IT-компаниях за рубежом, мы видим, что российский тренд по части кадров идет в противоположном направлении от общемирового. В течение последних 10 лет зарубежные ИТ-гиганты перегревали рынок труда, из-за чего потребность в специалистах искусственно повышалась. При этом она вовсе не отвечала реальным потребностям бизнеса, что видно по массовым увольнениям в мировых IT-гигантах сегодня.\n\n\nЧитать также\n\nКак найти IT-специалистов, когда вокруг все горит\n\nЦифровизация\nПока все в мире наблюдают за развитием метавселенных, отечественные компании более прагматичны и фокусируются на том, чтобы извлечь максимальный эффект от уже сделанных инвестиций в цифровизацию. В начале развития цифровой повестки большинство компаний только запускало эксперименты и относилось к этому как к лаборатории. Главный принцип вложения денег и времени звучал как «а вдруг что получится».\n\nТакие инновационные решения зачастую были оторваны от бизнеса, потому что создавались в стерильных условиях. А когда получившиеся цифровые продукты доходили до реального внедрения, организация их отторгала. Для их использования не были готовы ни процессы, ни структура, ни персонал, ни данные.\n\n\nСейчас же происходит эволюционный скачок: появляется больше понимания того, как успешно встроить инновационные решения в работу организаций.\n\nТаким образом, большинство компаний сейчас не инвестирует время и усилия в очередной десяток «прорывных» решений. Фокус на том, чтобы уже разработанные продукты и прототипы эффективно интегрировать в рабочие процессы и сделать так, чтобы они приносили пользу бизнесу. То есть внимание компаний смещается с самих технологий на задачи по трансформации операционной модели компании, внедрение современных подходов к управлению данными, а также развитию клиентоцентричности.\n\nВнедряемые решения должны улучшать клиентский опыт, а не просто играть имиджевую роль.\n\nЭтот тренд подтверждает опыт ведущих технологических компаний: раздутые инвестиции в новые направления и продукты значительно сворачиваются, что приводит к сокращению численности персонала. Штатную численность значительно оптимизируют Alibaba, Apple, Meta* Рlatforms, Twitter. Мы наблюдаем период стабилизации и извлечения реальных эффектов после периода бурного, а иногда и просто хайпового развития цифровых технологий.\n\nПозитивная часть этого тренда заключается в том, что еще несколько лет назад инвестиции в цифровизацию мог себе позволить, в основном, только крупный бизнес. Сейчас всё активнее цифровая повестка проникает в сегмент малого и среднего бизнеса. Во-первых, повышается общий уровень цифровой грамотности: как руководителей компаний этого сегмента, так и потребителей — во многом это результат пандемии. Во-вторых, это осознание того, что в наше непредсказуемое время аналоговый бизнес имеет очень большие риски. А чем более тесно бизнес-модель встроена в цифровую экономику и экосистему, тем она более гибкая и адаптируемая.\n\nОтдельно хочется сказать о метавселенных. Сейчас мы наблюдаем бум в части их продвижения как класса технологий. При этом надо понимать, что реальных выгод и сфер применения этой новой модели пока очень мало. Большинство компаний, активно интересующихся метавселенными, только нащупывают модели потребления и монетизации. Идет фаза концептуальной проработки технологии с попыткой ответить на вопросы: «для чего?» и «как на этом зарабатывать?». У кого-то наверняка получится.",
  "test": {
    "head": "Тест для закрепления материала",
    "body": [
      {
        "title": "Кто такие программисты?",
        "content": [
          {
            "title": "Консультанты в магазинах техники",
            "result": false
          },
          {
            "title": "Учителя информатики",
            "result": false
          },
          {
            "title": "Cпециалист, занимающийся созданием компьютерных программ",
            "result": true
          }
        ]
      },
      {
        "title": "Чем занимаются программисты 'Прикладного направления' ?",
        "content": [
          {
            "title": "Это специалисты, занимающиеся разработкой и внедрением программного обеспечения, необходимого для нормального функционирования организаций.",
            "result": true
          },
          {
            "title": "Это специалисты, работающие с глобальными сетями",
            "result": false
          },
          {
            "title": "Это специалисты, разрабатывающие операционные системы",
            "result": false
          }
        ]
      },
      {
        "title": "Чем занимаются программисты 'Web'?",
        "content": [
          {
            "title": "Это специалисты, разрабатывающие операционные системы",
            "result": false
          },
          {
            "title": "Это специалисты, работающие с глобальными сетями",
            "result": true
          },
          {
            "title": "Это специалисты, занимающиеся разработкой интерфейсов",
            "result": true
          }
        ]
      },
      {
        "title": "Карьера программиста напрямую зависит от",
        "content": [
          {
            "title": "Места работы",
            "result": true
          },
          {
            "title": "Навыков и способностей",
            "result": true
          },
          {
            "title": "Времени уделяемой работе",
            "result": false
          }
        ]
      },
      {
        "title": "Языки программирования для программиста это?",
        "content": [
          {
            "title": "Способ заработка",
            "result": true
          },
          {
            "title": "Развлечение, способ отдыха",
            "result": true
          },
          {
            "title": "Основной инструмент его работы",
            "result": true
          }
        ]
      }
    ]
  }
}